<?php

return [
    'nav' => [
        'title' => 'Крамниця',
        'settings' => 'Налаштування',
        'packages' => 'Набори',
        'gateways' => 'Методи оплати',
        'offers' => 'Товари',
        'coupons' => 'Купони',
        'giftcards' => 'Подарункові картки',
        'discounts' => 'Знижки',
        'payments' => 'Платежі',
        'purchases' => 'Замовлення',
        'statistics' => 'Статистика',
    ],

    'permissions' => [
        'admin' => 'Керування плагіном магазину',
    ],

    'categories' => [
        'title' => 'Категорії',
        'edit' => 'Редагувати категорію :category',
        'create' => 'Створити категорію',

        'parent' => 'Батьківська категорія',
        'delete_error' => 'Категорія з наборами не може бути видалена.',

        'cumulate' => 'Накопичувальні покупки в цій категорії',
        'cumulate_info' => 'Користувачі, які вже придбали пакет в цій категорії, отримають знижку та оплатять різницю тільки при покупці більш дорогого пакета.',
        'enable' => 'Активувати категорію',
    ],

    'offers' => [
        'title' => 'Товари',
        'edit' => 'Редагувати товар :offer',
        'create' => 'Створити товар',

        'enable' => 'Включіть цю пропозицію',
    ],

    'coupons' => [
        'title' => 'Купони',
        'edit' => 'Редагувати купон :coupon',
        'create' => 'Створити купон',

        'global' => 'Чи повинен купон діяти для всього магазину?',
        'cumulate' => 'Дозволити використовувати цей купон з іншими купонами',
        'user_limit' => 'Персональний ліміт',
        'global_limit' => 'Глобальний ліміт',
        'active' => 'Активовано',
        'usage' => 'Нижня межа використання',
        'enable' => 'Активувати купон',
    ],

    'giftcards' => [
        'title' => 'Подарункові картки',
        'edit' => 'Редагувати подарункову карту :giftcard',
        'create' => 'Створити подарункові картки',

        'global_limit' => 'Глобальні ліміти',
        'active' => 'Активовано',
        'enable' => 'Включіть також подарункову карту',
    ],

    'discounts' => [
        'title' => 'Знижки',
        'edit' => 'Змінити знижку :discount',
        'create' => 'Створити знижку',

        'global' => 'Чи повиннна знижка діяти для всього магазину?',
        'active' => 'Активовано',
        'enable' => 'Активувати знижку',
    ],

    'packages' => [
        'title' => 'Набори',
        'edit' => 'Редагувати пакет :package',
        'create' => 'Створити пакет',

        'updated' => 'Пакети були оновлені.',

        'money' => 'Гроші, які будуть зараховані користувачу після покупки',
        'giftcard' => 'Баланс подарункової карти, що створюватиметься під час покупки',
        'command' => 'Команда не повинна починатися з <code>/</code>. Ви можете використовувати <code>{player}</code> щоб використовувати ім\'я гравця. Для ігор Steam ви також можете використовувати <code>{steam_id}</code> та <code>{steam_id_32}</code>.',

        'custom_price' => 'Дозволити користувачеві вибрати ціну для оплати (ціна товару буде мінімальною)',
        'require_online' => 'Виконувати команди, коли користувач підключений до мережі на сервері (доступний тільки для AzLink)',
        'enable_quantity' => 'Увімкнути кількість',

        'create_category' => 'Створити категорію',
        'create_package' => 'Створити набір',

        'enable' => 'Активувати цей набір',
    ],

    'gateways' => [
        'title' => 'Методи оплати',
        'edit' => 'Редагувати шлюз :gateway',
        'create' => 'Додати метод оплати',

        'current' => 'Поточні методи оплати',
        'add' => 'Додати новий метод оплати',
        'info' => 'Якщо у вас виникли проблеми з AzLink при використанні Cloudflare або брандмауер, спробуйте повторити дії в <a href="https://azuriom.com/docs/faq" target="_blank" rel="noopener norefferer">FAQ</a>.',

        'country' => 'Країна',
        'sandbox' => 'Пісочниця',
        'api-key' => 'API ключ',
        'public-key' => 'Публічний ключ',
        'private-key' => 'Приватний ключ',
        'secret-key' => 'Секретний ключ',
        'endpoint-secret' => 'Секрет підписування',
        'service-id' => 'Ідентифікатор сервісу',
        'client-id' => 'Ідентифікатор клієнта',
        'merchant-id' => 'Ідентифікатор продавця',
        'project-id' => 'Ідентифікатор проекту',
        'env' => 'Оточення',

        'paypal_email' => 'Адреса електронної пошти PayPal',
        'paypal_info' => 'Обов’язково введіть <strong>основну</strong> електронну адресу облікового запису PayPal.',
        'paysafecard_info' => 'Для того, щоб мати можливість приймати платежі через paysafecard, ви повинні бути <a href="https://www.paysafecard.com/en/business/" target="_blank" rel="noopener noreferrer">постійним партнером</a>. Існують інші методи, але тільки цей дозволено paysafecard.',
        'stripe_info' => 'На головній панелі Stripe вам необхідно встановити URL-адресу вебхука на <code>:url</code> і вибрати подію <code>checkout.session.completed</code>.',
        'paymentwall_info' => 'На панелі управління PaymentWall вам необхідно встановити pingback-URL на <code>:url</code>.',
        'xsolla' => 'На панелі управління Xsolla вам необхідно встановити URL-адресу вебхука на <code>:url</code>, дозволити \'Зовнішній ID транзакції\' в налаштуваннях \'Pay station\', перевірити вебхуки і потім увімкнути \'Checkout\' в налаштуваннях \'Pay station\'.',

        'enable' => 'Активувати метод оплати',
    ],

    'payments' => [
        'title' => 'Платежі',
        'show' => 'Платіж #:payment',

        'info' => 'Платіжна інформація',
        'items' => 'Придбані товари',

        'card' => 'Платежі в магазині',

        'status' => [
            'pending' => 'Очікування',
            'expired' => 'Термін дії закінчився',
            'chargeback' => 'Повернення коштів',
            'completed' => 'Виконано',
            'refunded' => 'Відшкодовано',
            'error' => 'Помилка',
        ],
    ],

    'purchases' => [
        'title' => 'Замовлення',
    ],

    'settings' => [
        'title' => 'Параметри магазину',
        'enable_home' => 'Увімкнути домашню сторінку магазину',
        'home_message' => 'Привітальне повідомлення',
        'use_site_money' => 'Активувати оплату віртуальною валютою сайту.',
        'use_site_money_info' => 'Коли увімкнено, набори в магазині можуть бути придбані лише з коштами веб-сайту. Для того, щоб користувачі сплатили його рахунок, ви можете налаштувати пропозиції в магазині.',
        'webhook' => 'Вебхук Discord',
        'webhook_info' => 'Коли користувач здійснює платіж (за винятком покупок з віртуальною валютою сайту!), це створить сповіщення про цей webhook. Залиште порожнім, щоб відключити.',
        'commands' => 'Глобальні команди',
        'recent_payments' => 'Останні платежі дозволені на відображення в бічній панелі (0 для вимкнення)',
        'display_amount' => 'Відображати суму витрат в останніх платежах та найвищих покупців',
        'top_customer' => 'Відображати найкращих клієнтів місяця в бічній панелі',
    ],

    'logs' => [
        'shop-gateways' => [
            'created' => 'Додано метод оплати #:id',
            'updated' => 'Оновлено метод оплати #:id',
            'deleted' => 'Видалено метод оплати #:id',
        ],

        'shop-packages' => [
            'created' => 'Набір #:id створено',
            'updated' => 'Набір #:id оновлено',
            'deleted' => 'Набір #:id видалено',
        ],

        'shop-offers' => [
            'created' => 'Товар #:id створено',
            'updated' => 'Товар #:id оновлено',
            'deleted' => 'Товар #:id видалено',
        ],

        'shop-giftcards' => [
            'used' => 'Кількість використань подарункової картки #:id (:amount)',
        ],
    ],

    'statistics' => [
        'title' => 'Статистика',
        'total' => 'Загалом',
        'recent' => 'Останні платежі',
        'count' => 'Всього замовлень',
        'estimated' => 'Загальний заробіток',
        'month' => 'Замовлень за місяць',
        'month_estimated' => 'Приблизний заробіток у цьому місяці',
    ],

];
