<?php

return [
    'payment' => [
        'subject' => 'Дякуємо за покупку',
        'intro' => ':user, дякуємо за покупку! Ваш платіж було підтверджено і ви отримаєте замовлення через декілька хвилин.',
        'total' => 'Всього: :total',
        'transaction' => 'ID транзакції: :transaction (:gateway)',
        'date' => 'Дата: :date',
    ],

    'giftcard' => [
        'subject' => 'Ваш код подарункової карти',
        'intro' => 'Дякуємо за покупку! Ваша подарункова карта доступна.',
        'code' => 'Код: :code',
        'balance' => 'Баланс: :balance',
    ],
];
