<?php

return [
    'title' => 'Крамниця',
    'welcome' => 'Вітаємо у магазині!',

    'buy' => 'Придбати',

    'free' => 'Безкоштовно',

    'fields' => [
        'balance' => 'Баланс',
        'category' => 'Категорія',
        'code' => 'Код',
        'commands' => 'Команди',
        'currency' => 'Валюта',
        'discount' => 'Знижка',
        'expire_date' => 'Дата завершення',
        'gateways' => 'Методи оплати',
        'original_balance' => 'Оригінальний баланс',
        'package' => 'Набір',
        'packages' => 'Набори',
        'payment_id' => 'ID Платежу',
        'payments' => 'Платежі',
        'price' => 'Вартість',
        'quantity' => 'Кількість',
        'required_packages' => 'Необхідні набори',
        'required_roles' => 'Необхідна роль',
        'role' => 'Роль, що буде видана після покупки',
        'servers' => 'Сервери',
        'start_date' => 'Дата початку',
        'status' => 'Статус',
        'total' => 'Загалом',
        'user_id' => 'ID Користувача:',
        'user_limit' => 'Персональний ліміт покупок',
    ],

    'actions' => [
        'duplicate' => 'Дублювати',
        'remove' => 'Вилучити',
    ],

    'goal' => [
        'title' => 'Мета місяця',
        'progress' => ':count% завершено',
    ],

    'recent' => [
        'title' => 'Останні платежі',
        'empty' => 'Немає останніх платежів',
    ],

    'top' => [
        'title' => 'Топ покупець',
    ],

    'cart' => [
        'title' => 'Кошик',
        'success' => 'Вашу покупку успішно завершено.',
        'guest' => 'Ви повинні бути авторизовані для оформлення замовлення.',
        'empty' => 'Ваш кошик порожній.',
        'checkout' => 'Підрахунок',
        'remove' => 'Вилучити',
        'clear' => 'Очистити кошик',
        'pay' => 'Сплатити',
        'back' => 'Повернутися до крамниці',
        'total' => 'Загалом: :total',
        'payable_total' => 'Всього до сплати: :total',
        'credit' => 'Поповнити',

        'confirm' => [
            'title' => 'Сплатити?',
            'price' => 'Ви впевнені, що хочете придбати цей кошик за :price?',
        ],

        'errors' => [
            'money' => 'У Вас недостатньо коштів, для завершення даної покупки.',
            'execute' => 'Сталась непередбачена помилка при оплаті, після оплати вам надійшло повернення коштів.',
        ],
    ],

    'coupons' => [
        'title' => 'Купони',
        'add' => 'Додати купон',
        'error' => 'Даний купон не існує, вичерпано ліміт або сплинув термін його дії.',
        'cumulate' => 'Ви не можете використовувати цей купон з іншим купоном.',
    ],

    'payment' => [
        'title' => 'Платіж',
        'manual' => 'Ручна оплата',

        'empty' => 'Наразі немає доступних методів оплати.',

        'info' => 'Замовлення #:id на сайті :website',
        'error' => 'Неможливо завершити платіж.',

        'success' => 'Платіж завершений, ви отримаєте вашу покупку в грі менш ніж за хвилину.',

        'webhook' => 'Новий платіж у магазині',
        'webhook_info' => 'Всього: :total, ID: :id (:gateway)',
    ],

    'categories' => [
        'empty' => 'Дана категорія порожня.',
    ],

    'packages' => [
        'limit' => 'Ви придбали максимально можливу кількість для даного набору.',
        'requirements' => 'У вас немає вимог до придбання цього пакунку.',
    ],

    'offers' => [
        'gateway' => 'Тип оплати',
        'amount' => 'Сума',

        'empty' => 'На даний момент немає жодного доступного товару.',
    ],

    'profile' => [
        'payments' => 'Ваші платежі',
        'money' => 'Гроші: :balance',
    ],

    'giftcards' => [
        'title' => 'Подарункові картки',
        'success' => ':money було нараховано на ваш рахунок',
        'error' => 'Даний подарунковий код не існує, вичерпано ліміт або сплинув період його дії.',
        'add' => 'Додати подарункову карту',
        'notification' => 'Ви отримали подарункову карту, код :code (:balance).',
    ],
];
