<?php

return [
    'title' => 'Підтримка',

    'fields' => [
        'subject' => 'Тема',
        'category' => 'Категорія',
        'ticket' => 'Тікет',
        'comment' => 'Коментар',
    ],

    'actions' => [
        'create' => 'Відкрити новий тікет',
        'reopen' => 'Перевідкрити',
        'close' => 'Закрити',
    ],

    'state' => [
        'open' => 'Відкрито',
        'closed' => 'Закрито',
        'replied' => 'Відповіли',
    ],

    'tickets' => [
        'closed' => 'Цей запит закритий.',

        'open' => 'Відкрити тікет
',

        'notification' => 'Нова відповідь на Ваш запит підтримки.',

        'info' => '<strong>:author</strong> створив цей тікет у категорії <strong>:category</strong> у :date.',
    ],

    'webhook' => [
        'ticket' => 'Новий тікет',
        'comment' => 'Новий коментар в тікеті',
        'closed' => 'Тікет закрито
',
    ],

    'mails' => [
        'comment' => [
            'subject' => 'Нова відповідь на вашу заявку у службі підтримки',
            'message' => 'Вітаємо, :user, ваш тікет на підтримку #:id отримав нову відповідь від :author.',
            'view' => 'Переглянути тікет',
        ],
    ],

    'days' => 'годин',
];
