<?php

return [
    'title' => 'Голосование',

    'sections' => [
        'vote' => 'Проголосовать',
        'top' => 'Рейтинг голосований',
        'rewards' => 'Награды',
    ],

    'fields' => [
        'chances' => 'Вероятность',
        'commands' => 'Команды',
        'reward' => 'Награда',
        'rewards' => 'Награды',
        'servers' => 'Серверы',
        'site' => 'Сайт',
        'votes' => 'Голоса',
    ],

    'errors' => [
        'user' => 'Такого пользователя не существует!',
        'site' => 'Сейчас нет доступных сайтов для голосования.',
        'delay' => 'Вы уже голосовали, проголосовать снова можно будет в :time !',
    ],

    'success' => 'Ваш голос был принят, вы скоро получите награду « :reward »!',
];
