<?php

return [
    'title' => 'Вікі',

    'categories' => [
        'title' => 'Категорії',
        'edit' => 'Редагувати категорію :category',
        'create' => 'Додати категорію',

        'add' => 'Додати категорію',
        'enable' => 'Увімкнути цю категорію',
        'parent' => 'Батьківська категорія',
        'private' => 'Обмеження ролей доступу до даної категорії',

        'empty' => 'Поки що жодна категорія ще не була створена.',
    ],

    'pages' => [
        'category' => 'категорія',
        'updated' => 'Оновлено порядок сторінок.',
    ],

    'permission' => 'Управління Вікі',
];
