<?php

return [
    'title' => 'Вики',

    'categories' => [
        'title' => 'Категории',
        'edit' => 'Редактировать категорию :category',
        'create' => 'Добавить категорию',

        'add' => 'Добавить категорию',
        'enable' => 'Включить категорию',
        'parent' => 'Родительская категория',
        'private' => 'Ограничить роли с доступом к этой категории',

        'empty' => 'Пока ни создано ни одной категории.',
    ],

    'pages' => [
        'category' => 'категория',
        'updated' => 'Порядок страниц обновлен.',
    ],

    'permission' => 'Управление wiki',
];
