<?php

return [
    'header' => [
        'online' => ':count игрок в сети|:count игроков в сети',
        'offline' => 'Сервер в настоящее время отключен',
    ],
    'footer' => [
        'about' => 'О нас',
        'links' => 'Ссылки',
        'social' => 'Социальные сети',
    ],
    'config' => [
        'home_title' => 'Заголовок главной',
        'footer_description' => 'Описание нижнего колонтитула',
        'footer_links' => 'Ссылки нижнего колонтитула',
    ],
    'colors' => [
        'red' => 'Красный',
        'blue' => 'Синий',
        'green' => 'Зелёный',
        'purple' => 'Фиолетовый',
        'orange' => 'Оранжевый',
        'yellow' => 'Жёлтый',
        'aqua' => 'Бирюзовый',
        'pink' => 'Розовый',
    ],
];
