<?php

return [

    'nav' => [
        'settings' => 'Налаштування',
        'forums' => 'Форуми',
        'tags' => 'Мітки',
    ],

    'settings' => [
        'title' => 'Налаштування форуму',
        'home_message' => 'Привітальне повідомлення',
        'webhook' => 'Вебхук Discord',
        'webhook_info' => 'Повідомлення буде надіслано в цьому вебхуку, коли буде опубліковане нове повідомлення. Залиште порожнім, щоб вимкнути',
    ],

    'categories' => [
        'title' => 'Категорії',
        'edit' => 'Редагувати категорію :category',
        'create' => 'Створити категорію',

        'delete_error' => 'Ця категорія містить форуми, тому не може бути видалена.',
    ],

    'forums' => [
        'title' => 'Форуми',
        'create' => 'Створити форум',
        'edit' => 'Редагувати форум :forum',

        'create_category' => 'Створити категорію',
        'create_forum' => 'Створити форум',

        'parent' => 'Батьківський форум',
        'restricted' => 'Обмежити доступ до цього форуму тільки для окремимих ролей',
        'default_tags' => 'Мітки за замовчуванням',
        'lock' => 'Заблокувати цей форум',
        'lock_info' => 'Користувачі, які не є адміністраторами, не зможуть створювати обговорення.',
        'private' => 'Приватний Форум',
        'private_info' => 'Користувачі можуть бачити тільки власні обговорення та закріплення.',

        'updated' => 'Порядок форумів оновлено.',
        'delete_error' => 'Форум з підфорумами не може бути видалено.',
    ],

    'discussions' => [
        'card' => 'Обговорення на форумі',
    ],

    'posts' => [
        'card' => 'Публікації на форумі',

        'recent' => 'Останні публікації на головній сторінці',
        'delay' => 'Затримка між публікаціями',
        'seconds' => 'сек.',
    ],

    'tags' => [
        'title' => 'Мітки',
        'create' => 'Створити мітку',
    ],

    'logs' => [
        'forum-discussions' => [
            'deleted' => 'Обговорення #:id видалено',
            'pinned' => 'Обговорення #:id закріплено',
            'unpinned' => 'Обговорення #:id відкріплено',
            'locked' => 'Обговорення #:id заблоковано',
            'unlocked' => 'Обговорення #:id розблоковано',
        ],

        'forum-posts' => [
            'deleted' => 'Запис #:id видалено',
        ],

        'forum-categories' => [
            'created' => 'Категорію форуму #:id створено',
            'updated' => 'Категорію форуму #:id оновлено',
            'deleted' => 'Категорію форуму #:id видалено',
        ],

        'forum-forums' => [
            'created' => 'Створено форум #:id',
            'updated' => 'Оновлено форум #:id',
            'deleted' => 'Видалено форум #:id',
        ],
    ],

    'permissions' => [
        'forums' => 'Управління форумами та категоріями',
        'discussions' => 'Керування обговореннями форуму (переміщення, редагування, видалення, блокування)',
        'private' => 'Переглядати обговорення від інших користувачів на приватних форумах',
        'delete_own_posts' => 'Видалити свої публікації на форумі',
        'locked' => 'Створити дискусію в заблокованому форумі'
    ],
];
