<?php

return [
    'title' => 'Форум',

    'fields' => [
        'forum' => 'Форум',
        'tags' => 'Мітки',
        'editor' => 'Редактор',
    ],

    'actions' => [
        'pin' => 'Закріпити',
        'unpin' => 'Відкріпити',
        'lock' => 'Заблокувати',
        'unlock' => 'Розблокувати',
    ],

    'latest' => [
        'title' => 'Останні публікації',
    ],

    'stats' => [
        'title' => 'Статистика',

        'discussions' => 'Обговорення: :count',
        'posts' => 'Повідомлення: :count',
        'users' => 'Користувачі: :count',
    ],

    'online' => [
        'title' => 'Користувачі у мережі',

        'none' => 'Немає користувачів онлайн...',
    ],

    'forums' => [
        'discussions' => ':count обговорення|:count обговорень',

        'locked' => 'Цей форум заблоковано.',
    ],

    'discussions' => [
        'title' => 'Обговорення',
        'create' => 'Створити обговорення',
        'edit' => 'Редагувати обговорення',

        'pin' => 'Закріпити це обговорення',
        'lock' => 'Заблокувати це обговорення',

        'respond' => 'Відповісти',
        'views' => ':count перегляд|:count переглядів',

        'locked' => 'Заблоковано',
        'pinned' => 'Закріплено',

        'locked_info' => 'Обговорення закрито.',

        'posts' => ':count публікація|:count публікацій',

        'delete' => 'Ви впевнені, що бажаєте видалити дане обговорення?',

        'status' => [
            'created' => 'Обговорення створене.',
            'updated' => 'Обговорення змінено.',
            'deleted' => 'Обговорення видалено.',

            'pinned' => 'Обговорення закріплено.',
            'unpinned' => 'Обговорення відкріплено.',
            'locked' => 'Обговорення закрито.',
            'unlocked' => 'Обговорення відкрито.',
        ],
    ],

    'posts' => [
        'title' => 'Публікації',
        'edit' => 'Редагувати публікацію',

        'delay' => 'Ви можете надіслати повідомлення знову через :time.',

        'delete' => 'Ви дійсно хочете видалити це повідомлення?',

        'status' => [
            'created' => 'Публікація опублікована.',
            'updated' => 'Публікацію змінено.',
            'deleted' => 'Дану публікацію було видалено.',
        ],
    ],

    'notifications' => [
        'reply' => ':user відповів у вашому обговоренні :discussion',
        'mention' => ':user згадав вас в :discussion',
    ],

    'profile' => [
        'likes' => 'Вподобання',
        'posts' => 'Публікації',
        'discussions' => 'Обговорення',

        'information' => 'Інформація',
        'edit' => 'Редагувати профіль',

        'location' => 'Місцезнаходження',
        'website' => 'Вебсайт',
        'about' => 'Біографія',
        'signature' => 'Підпис',
        'registered' => 'Зареєстрований',
        'last_seen' => 'Востаннє в мережі',
        'display_last_seen' => 'Відображати останній візит',
    ],
];
