<?php

return [
    'header' => [
        'online' => 'Гравців онлайн: :count|Гравців онлайн: :count',
        'offline' => 'Сервер зупинено',
    ],
    'footer' => [
        'about' => 'Про нас',
        'links' => 'Посилання',
        'social' => 'Соціальні мережі',
    ],
    'config' => [
        'home_title' => 'Заголовок домашньої сторінки',
        'footer_description' => 'Опис в нижньому колонтитулі',
        'footer_links' => 'Посилання в нижньому колонтитулі',
    ],
    'colors' => [
        'red' => 'Червоний',
        'blue' => 'Синій',
        'green' => 'Зелений',
        'purple' => 'Фіолетовий',
        'orange' => 'Помаранчевий',
        'yellow' => 'Жовтий',
        'aqua' => 'Блакитний',
        'pink' => 'Рожевий',
    ],
];
