<?php

return [
    'nav' => [
        'title' => 'Магазин',
        'settings' => 'Настройки',
        'packages' => 'Пакеты',
        'gateways' => 'Способы оплаты',
        'offers' => 'Предложения',
        'coupons' => 'Купоны',
        'giftcards' => 'Подарочные карты',
        'discounts' => 'Скидки',
        'payments' => 'Платежи',
        'purchases' => 'Покупки',
        'statistics' => 'Статистика',
    ],

    'permissions' => [
        'admin' => 'Управление плагином магазина',
    ],

    'categories' => [
        'title' => 'Категории',
        'edit' => 'Редактировать категорию :category',
        'create' => 'Создать категорию',

        'parent' => 'Вышестоящая категория',
        'delete_error' => 'Категорию с комплектами нельзя удалить.',

        'cumulate' => 'Накопленные покупки из этой категории',
        'cumulate_info' => 'Пользователи, которые уже приобрели пакет в этой категории, получат скидку и будут платить только разницу при покупке более дорогих пакетов.',
        'enable' => 'Включить категорию',
    ],

    'offers' => [
        'title' => 'Предложения',
        'edit' => 'Редактировать предложение :offer',
        'create' => 'Создать предложение',

        'enable' => 'Включить это предложение',
    ],

    'coupons' => [
        'title' => 'Купоны',
        'edit' => 'Изменить купон :купон',
        'create' => 'Создать купон',

        'global' => 'Должен ли купон быть активен на всех магазинах ?',
        'cumulate' => 'Разрешить использование этого купона с другими',
        'user_limit' => 'Лимит пользователей',
        'global_limit' => 'Общие ограничения',
        'active' => 'Активен',
        'usage' => 'Ограничение использования',
        'enable' => 'Включить купон',
    ],

    'giftcards' => [
        'title' => 'Подарочные карты',
        'edit' => 'Редактирование подарочной карты :giftcard',
        'create' => 'Создание подарочной карты',

        'global_limit' => 'Глобальный лимит',
        'active' => 'Активна',
        'enable' => 'Включить подарочную карту',
    ],

    'discounts' => [
        'title' => 'Скидки',
        'edit' => 'Редактирование скидки :discount',
        'create' => 'Создание скидки',

        'global' => 'Должна ли скидка быть активна во всех магазинах?',
        'active' => 'Активен',
        'enable' => 'Включить скидку',
    ],

    'packages' => [
        'title' => 'Пакеты',
        'edit' => 'Редактирование комплекта :package',
        'create' => 'Создание комплекта',

        'updated' => 'Комплекты обновлены.',

        'money' => 'Сумма, выдаваемая пользователю после покупки',
        'giftcard' => 'Баланс создаваемой подарочной карты во время покупки',
        'command' => 'Команда не должна начинаться с <code>/</code>. Вы можете использовать <code>{player}</code> для имени игрока. В играх Steam можно также использовать <code>{steam_id}</code> и <code>{steam_id_32}</code>. Другие доступные плейсхолдеры: :placeholders.',

        'custom_price' => 'Разрешить пользователю выбрать цену (цена пакета будет минимальная)',
        'require_online' => 'Запускать команды только при наличии игрока на сервере (доступно только с AzLink)',
        'enable_quantity' => 'Включить количество',

        'create_category' => 'Создать категорию',
        'create_package' => 'Создать комплект',

        'enable' => 'Включить этот пакет',
    ],

    'gateways' => [
        'title' => 'Способы оплаты',
        'edit' => 'Редактирование способа оплаты :gateway',
        'create' => 'Добавление способа оплаты',

        'current' => 'Текущие способы оплаты',
        'add' => 'Добавление нового способа оплаты',
        'info' => 'Если у вас проблемы с AzLink при использовании Cloudflare или брандмауэра, попробуйте следовать шагам из этой инструкции <a href="https://azuriom.com/docs/faq" target="_blank" rel="noopener norefferer">FAQ</a>.',

        'country' => 'Страна',
        'sandbox' => 'Песочница',
        'api-key' => 'Ключ API',
        'public-key' => 'Публичный ключ',
        'private-key' => 'Приватный ключ',
        'secret-key' => 'Секретный ключ',
        'endpoint-secret' => 'Секрет подписи',
        'service-id' => 'ID сервиса',
        'client-id' => 'ID клиента',
        'merchant-id' => 'ID продавца',
        'project-id' => 'ID Проекта',
        'env' => 'Окружение',

        'paypal_email' => 'Адрес электронной почты PayPal',
        'paypal_info' => 'Пожалуйста, не забудьте ввести адрес электронной почты <strong>основного</strong> аккаунта PayPal.',
        'paysafecard_info' => 'Чтобы иметь возможность принимать платежи через paysafecard, вы должны быть <a href="https://www.paysafecard.com/en/business/" target="_blank" rel="noopener noreferrer">партнером paysafecard</a>. Существуют и другие методы, но только с разрешения paysafecard.',
        'stripe_info' => 'В панели управления Stripe вам нужно установить URL webhook <code>:url</code> и выбрать событие <code>checkout.session.completed</code>.',
        'paymentwall_info' => 'В панели PaymentWall вам нужно установить URL обратной связи <code>:url</code>.',
        'xsolla' => 'В панели инструментов Xsolla необходимо задать URL webhook <code>:url</code>, включите «Внешний идентификатор транзакции» в настройках «Платная станция», протестируйте вебхуки и затем включите «Оформить заказ» в настройках «Платная станция».',

        'enable' => 'Включить способ оплаты',
    ],

    'payments' => [
        'title' => 'Платежи',
        'show' => 'Платёж #:payment',

        'info' => 'Информация о платеже',
        'items' => 'Купленные предметы',

        'card' => 'Платежи магазина',

        'status' => [
            'pending' => 'В ожидании',
            'expired' => 'Истёк',
            'chargeback' => 'Возврат денег',
            'completed' => 'Завершено',
            'refunded' => 'Возвращено',
            'error' => 'Ошибка',
        ],
    ],

    'purchases' => [
        'title' => 'Покупки',
    ],

    'settings' => [
        'title' => 'Настройки магазина',
        'enable_home' => 'Включить домашнюю страницу магазина',
        'home_message' => 'Приветственное сообщение',
        'use_site_money' => 'Включите покупки с помощью внутренней валюты сайта.',
        'use_site_money_info' => 'Когда включено, пакеты в магазине могут быть приобретены только за деньги сайта. Для того, чтобы пользователи могли зачислить свои аккаунты, вы можете создать предложения в магазине.',
        'webhook' => 'URL Discord Вебхука',
        'webhook_info' => 'Когда пользователь производит платёж создается уведомление через этот webhook. Оставьте пустым для выключения',
        'commands' => 'Глобальные команды',
        'recent_payments' => 'Лимит последних платежей для отображения в боковой панели (0 для отключения)',
        'display_amount' => 'Отображать сумму траты в последних платежах и лучших клиентах',
        'top_customer' => 'Отображать лучшие ежемесячные клиенты в боковой панели',
    ],

    'logs' => [
        'shop-gateways' => [
            'created' => 'Платёжная система создана',
            'updated' => 'Платёжная система обновлена',
            'deleted' => 'Платёжная система удалена',
        ],

        'shop-packages' => [
            'created' => 'Набор создан',
            'updated' => 'Набор обновлен',
            'deleted' => 'Набор удалён',
        ],

        'shop-offers' => [
            'created' => 'Предложение создано',
            'updated' => 'Предложение обновлено',
            'deleted' => 'Предложение удалено',
        ],

        'shop-giftcards' => [
            'used' => 'Используется подарочная карта #:id (:amount)',
        ],
    ],

    'statistics' => [
        'title' => 'Статистика',
        'total' => 'Итого',
        'recent' => 'Недавние платежи',
        'count' => 'Количество платежей',
        'estimated' => 'Расчетный доход',
        'month' => 'Платежи в этом месяце',
        'month_estimated' => 'Расчетный доход в этом месяце',
    ],

];
