<?php

return [
    'nav' => [
        'title' => 'Голосування',
        'settings' => 'Налаштування',
        'sites' => 'Сайти',
        'rewards' => 'Нагороди',
        'votes' => 'Голоси',
    ],

    'permission' => 'Керувати плагіном голосування',

    'settings' => [
        'title' => 'Параметри голосувань',

        'count' => 'Кількість гравців в ретинзі',
        'display-rewards' => 'Показати нагороди на сторінці голосування',
        'ip_compatibility' => 'Увімкнути сумісність IPv4/IPv6',
        'ip_compatibility_info' => 'Ця опція дозволяє виправляти голоси, які не підтверджені на сайтах голосування, які не приймають IPv6, поки ваш сайт робить, або навпаки.',
        'commands' => 'Глобальні команди',
    ],

    'sites' => [
        'title' => 'Сайти',
        'edit' => 'Редагувати сайт :site',
        'create' => 'Створити сайт',

        'enable' => 'Активувати сайт',
        'delay' => 'Затримка між голосами',
        'minutes' => 'хв.',

        'list' => 'Сайти, за якими можна перевірити голоси',
        'variable' => 'Ви можете використовувати <code>{player}</code> для використання в імені гравця.',

        'verifications' => [
            'title' => 'Верифікація',
            'enable' => 'Увімкнути перевірку голосів',

            'disabled' => 'Голоси на цьому сайті не будуть перевірені.',
            'auto' => 'Голоси на цьому сайті будуть автоматично верифіковані.',
            'input' => 'Голоси на цьому сайті будуть перевірені, коли поле нижче заповнене.',

            'pingback' => 'Pingback URL: :url',
            'secret' => 'Секретний ключ',
            'server_id' => 'ID серверу',
            'token' => 'Токен',
            'api_key' => 'API ключ',
        ],
    ],

    'rewards' => [
        'title' => 'Нагороди',
        'edit' => 'Редагувати нагороду :reward',
        'create' => 'Створити нагороду',

        'require_online' => 'Виконувати команди, коли користувач підключений до мережі на сервері (доступний тільки для AzLink)',
        'enable' => 'Активувати нагороду',

        'commands' => 'Ви можете використовувати <code>{player}</code> для використання імені гравця, <code>{reward}</code> для імені винагороди та <code>{site}</code> для веб-сайту для голосування. Для ігор Steam ви також можете використовувати <code>{steam_id}</code> і <code>{steam_id_32}</code>. Команда не повинна починатися з <code>/</code>.',
        'monthly' => 'Рейтинг користувачів, щоб надати цю нагороду в кінці місяця',
        'monthly_info' => 'Автоматично давати цю нагороду, в кінці місяця, користувачам на зазначених посадах в найкращих виборців рейтингу.',
        'cron' => 'Ви повинні встановити завдання CRON для використання автоматичних нагород в кінці місяця.',
    ],

    'votes' => [
        'title' => 'Голоси',

        'empty' => 'Протягом цього місяця ще ніхто не голосував.',
        'votes' => 'Кількість голосів',
        'month' => 'Кількість голосів у цьому місяці',
        'week' => 'Кількість голосів у цьому тижні',
        'day' => 'Кількість голосів сьогодні',
    ],

    'logs' => [
        'vote-sites' => [
            'created' => 'Створений сайт голосу #:id',
            'updated' => 'Оновлено сайт голосування #:id',
            'deleted' => 'Видалено голос сайту #:id',
        ],

        'vote-rewards' => [
            'created' => 'Створена нагорода за голосування #:id',
            'updated' => 'Оновлено метод оплати #:id',
            'deleted' => 'Видалено нагороду голосу #:id',
        ],
    ],
];
