<?php

return [
    'title' => 'Голосування',

    'sections' => [
        'vote' => 'Голосування',
        'top' => 'Рейтинг голосів',
        'rewards' => 'Нагороди',
    ],

    'fields' => [
        'chances' => 'Шанси',
        'commands' => 'Команди',
        'reward' => 'Винагорода',
        'rewards' => 'Нагороди',
        'servers' => 'Сервери',
        'site' => 'Веб-сайт',
        'votes' => 'Голоси',
    ],

    'errors' => [
        'user' => 'Цього користувача не існує',
        'site' => 'Наразі немає доступних сайтів для голосування.',
        'delay' => 'Ви вже проголосували! Повторно проголосувати ви зможете через :time!',
    ],

    'success' => 'Ваш голос враховано, ви скоро отримаєте нагороду « :reward »!',
];
