<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Admin Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used on the admin dashboard
    |
    */

    'nav' => [
        'dashboard' => 'Панель керування',
        'settings' => [
            'heading' => 'Налаштування',
            'settings' => 'Налаштування',
            'global' => 'Глобальний',
            'security' => 'Безпека',
            'performances' => 'Продуктивність',
            'seo' => 'SEO',
            'auth' => 'Авторизація',
            'mail' => 'Пошта',
            'maintenance' => 'Технічне обслуговування',
            'social' => 'Соціальні мережі',
            'navbar' => 'Панель навігації',
            'servers' => 'Сервери',
        ],

        'users' => [
            'heading' => 'Користувачі',
            'users' => 'Користувачі',
            'roles' => 'Ролі',
            'bans' => 'Бани',
        ],

        'content' => [
            'heading' => 'Вміст',
            'pages' => 'Сторінки',
            'posts' => 'Публікації',
            'images' => 'Зображення',
            'redirects' => 'Перенаправлення',
        ],

        'extensions' => [
            'heading' => 'Розширення',
            'plugins' => 'Модулі',
            'themes' => 'Теми',
        ],

        'other' => [
            'heading' => 'Інше',
            'update' => 'Оновлення',
            'logs' => 'Логи',
        ],

        'profile' => [
            'profile' => 'Профіль',
        ],

        'back' => 'Повернутися на сайт',
        'support' => 'Підтримка',
        'documentation' => 'Документація',
    ],

    'delete' => [
        'title' => 'Видалити?',
        'description' => 'Ви впевнені, що хочете видалити це? Ви не зможете скасувати цю дію!',
    ],

    'footer' => 'Запущено на :azuriom &copy; :year. Панель створена за допомогою :startbootstrap.',

    /*
    |
    | Admin pages
    |
    */

    'dashboard' => [
        'title' => 'Панель керування',

        'users' => 'Користувачі',
        'posts' => 'Публікації',
        'pages' => 'Сторінки',
        'images' => 'Зображення',

        'update' => 'Доступна нова версія Azuriom: :version',
        'http' => 'Ваш сайт не використовує https! Ви повинні обов\'язково активувати його для безпеки користувачів.',
        'cloudflare' => 'Для використання Cloudflare вам необхідно встановити плагін, "Cloudflare Support".
',
        'recent_users' => 'Останні користувачі',
        'active_users' => 'Активні користувачі',
        'emails' => 'Електронна скринька вимкнена. Якщо користувач забуде свій пароль, він не зможе відновити його. Ви можете увімкнути електронну пошту в <a href=":url">налаштуваннях пошти</a>.',
    ],

    'settings' => [
        'index' => [
            'title' => 'Загальні налаштування',

            'name' => 'Назва сайту',
            'url' => 'Посилання сайту',
            'description' => 'Опис сайту',
            'meta' => 'Мета-теги',
            'meta_info' => 'Ключові слова повинні бути розділені комою.',
            'favicon' => 'Іконка',
            'background' => 'Фон',
            'logo' => 'Логотип',
            'timezone' => 'Часовий пояс',
            'locale' => 'Локалізація',
            'money' => 'Назва валюти сайту',
            'copyright' => 'Авторське право',
            'user_money_transfer' => 'Дозволити грошові перекази між користувачами',
            'site_key' => 'Ключ сайту для azuriom.com',
            'site_key_info' => 'Ключ сайту azuriom.com необхідний для встановлення преміум-розширень, придбаних на ринку. Ви можете його отримати у вашому <a href="https://market.azuriom.com/profile" target="_blank" rel="noopener norefferer">профілі Azuriom</a>.',
            'webhook' => 'Посилання на пост через вебхук Discord',
            'webhook_info' => 'Вебхук Discord буде відправлений до цього URL при створенні нового повідомлення, якщо дати публікації нема. Залиште порожнім для відключення.',
        ],

        'security' => [
            'title' => 'Налаштування безпеки',

            'captcha' => [
                'title' => 'Капча',
                'site_key' => 'Ключ сайту',
                'secret_key' => 'Секретний ключ',
                'recaptcha' => 'Ви можете отримати ключі reCaptcha на сайті <a href="https://www.google.com/recaptcha/" target="_blank" rel="noopener noreferrer"> Google reCaptcha</a>. Вам необхідно використовувати ключі reCaptcha <strong>v2 невидимі</strong> ключі.',
                'hcaptcha' => 'Ви можете отримати ключі hCaptcha на <a href="https://www.hcaptcha.com/" target="_blank" rel="noopener noreferrer"> сайті hCaptcha</a>.',
                'turnstile' => 'Ви можете отримати ключі Turnstil на <a href="https://dash.cloudflare.com/?to=/:account/turnstile" target="_blank" rel="noopener noreferrer">Панель керування Cloudflare</a>. Виберіть віджет "Managed".',
            ],

            'hash' => 'Алгоритм хеша',
            'hash_error' => 'Цей хеш-алгоритм не підтримується поточною версією PHP.',
            'force_2fa' => 'Вимагати 2FA для доступу до панелі адміністратора',
        ],

        'performances' => [
            'title' => 'Налаштування продуктивності',

            'cache' => [
                'title' => 'Очистити кеш',
                'clear' => 'Очистити кеш',
                'description' => 'Очистити кеш сайту.',
                'error' => 'Помилка при очищенні кешу.',
            ],

            'boost' => [
                'title' => 'AzBoost',
                'description' => 'AzBoost покращує продуктивність вашого сайту, додавши ще один рівень кешу.',
                'info' => 'Якщо у вас є проблеми після увімкнення розширення, треба перезавантажити кеш.',

                'enable' => 'Увімкнути AzBoost',
                'disable' => 'Вимкнути AzBoost',
                'reload' => 'Перезавантажити AzBoost',

                'status' => 'AzBoost наразі :status.',
                'enabled' => 'увімкнено',
                'disabled' => 'вимкнено',

                'error' => 'Помилка при увімкненні AzBoost.',
            ],
        ],

        'seo' => [
            'title' => 'SEO налаштування',

            'html' => 'Ви можете додати HTML-код в <code>&lt;head&gt;</code> або <code>&lt;body&gt;</code> всіх сторінок (наприклад, для банера або веб-аналітики) створивши файл з назвою <code>head.blade.php</code> або <code>body.blade.php</code> в папці <code>resources/views/custom/</code> folder.',
            'home_message' => 'Привітальне повідомлення',

            'welcome_alert' => [
                'enable' => 'Увімкнути спливаюче вікно з привітанням?',
                'message' => 'Спливаюче привітальне повідомлення',
                'info' => 'Це спливаюче вікно буде відображатися вперше, коли користувач відвідує сайт.',
            ],
        ],

        'auth' => [
            'title' => 'Автентифікація',

            'conditions' => 'Умови, які будуть прийняті для реєстрації',
            'conditions_info' => 'Посилання в форматі Markdown, наприклад: <code>я приймаю [умови використання](/conditions-link) та [політику конфіденційності](/privacy-policy)</code>',
            'registration' => 'Дозволити реєстрацію',
            'registration_info' => 'Також можна реєструватися через плагін.',
            'api' => 'Увімкнути Auth API',
            'api_info' => 'Цей API дає змогу додати власну аутентифікацію до вашого ігрового сервера. Для Minecraft серверів з використанням лаунчера, ви можете використовувати <a href="https://github.com/Azuriom/AzAuth" target="_blank" rel="noopener noreferrer">AzAuth</a> для легкої й швидкої інтеграції.',
            'user_change_name' => 'Дозволити користувачам змінювати ім\'я користувача з свого профілю',
            'user_delete' => 'Дозволити користувачам видаляти свій обліковий запис зі свого профілю',
        ],

        'mail' => [
            'title' => 'Налаштування пошти',
            'from' => 'Адреса електронної пошти для надсилання листів',
            'mailer' => 'Тип електронної пошти',
            'mailer_info' => 'Azuriom підтримує SMTP та Sendmail для надсилання електронних листів. Більш детальну інформацію про конфігурацію пошти ви можете знайти в <a href="https://azuriom.com/docs" target="_blank" rel="noopener noreferrer">документації</a>.',
            'disabled' => 'Коли електронна пошта вимкнена, користувачі не зможуть змінити свій пароль, якщо вони забули його.',
            'sendmail' => 'Не рекомендується використання Sendmail. Замість цього краще скористайтеся SMTP сервером, якщо це можливо.',
            'smtp' => [
                'host' => 'Адреса SMTP хоста',
                'port' => 'Порт SMTP хоста',
                'encryption' => 'Протокол шифрування',
                'username' => 'Нікнейм користувача SMTP серверу',
                'password' => 'Пароль SMTP серверу',
            ],
            'verification' => 'Включити перевірку адреси електронної пошти користувача',
            'send' => 'Надіслати тестовий лист',
            'sent' => 'Тестове повідомлення успішно надіслано.',
            'missing' => 'Не вказана адреса електронної пошти для вашого облікового запису.',
        ],

        'maintenance' => [
            'title' => 'Налаштування тех. обслуговування',

            'enable' => 'Увімкнути режим обслуговування',
            'message' => 'Повідомлення тех. обслуговування',
            'global' => 'Увімкнути обслуговування на всіх сайтах',
            'paths' => 'Шляхи для блокування під час обслуговування',
            'info' => 'Ви можете використовувати <code>/*</code> для блокування всіх сторінок, починаючи з одного шляху. Наприклад:  "<code>/news/*</code>" заблокує доступ до всіх новин.',
        ],

        'updated' => 'Налаштування оновлено.',
    ],

    'navbar_elements' => [
        'title' => 'Панель навігації',
        'edit' => 'Редагувати елемент панелі навігації :element',
        'create' => 'Створити елемент панелі навігації',

        'restrict' => 'Обмеження ролей, які зможуть побачити цей елемент',
        'dropdown' => 'Ви можете додати елементи до цього випадаючого списку, коли цей елемент збережено.',

        'fields' => [
            'home' => 'Додому',
            'link' => 'Зовнішнє посилання',
            'page' => 'Сторінка',
            'post' => 'Публікація',
            'posts' => 'Список публікацій',
            'plugin' => 'Плагін',
            'dropdown' => 'Випадаючий список',
            'new_tab' => 'Відкрити у новій вкладці',
        ],

        'updated' => 'Навігаційну панель оновлено.',
        'not_empty' => 'Ви не можете видалити випадаючий список з елементами.',
    ],

    'social_links' => [
        'title' => 'Соціальні посилання',
        'edit' => 'Редагувати соціальні посилання :link',
        'create' => 'Додати соціальне посилання',
    ],

    'servers' => [
        'title' => 'Сервери',
        'edit' => 'Редагувати сервер :server',
        'create' => 'Додати сервер',

        'default' => 'Сервер за замовчуванням',
        'default_info' => 'Кількість гравців підключених до сервера за замовчуванням будуть відображатися на сайті, якщо поточна тема підтримує дану функцію.',

        'home_display' => 'Відображати цей сервер на головній сторінці',
        'url' => 'URL кнопки Приєднатися',
        'url_info' => 'Залиште пустим, щоб відобразити адресу сервера. Може бути посиланням на завантаження гри чи посилання для приєднання до сервера <code>steam://connect/&lt;ip&gt;</code>.',

        'ping_info' => 'Для ping-з\'єднання не потрібен плагін, але ви не зможете виконувати серверні команди.',
        'query_info' => 'За допомогою швидкого посилання неможливо виконати команди на сервері.',

        'query_port_info' => 'Може бути порожнім, якщо збігається з ігровим портом.',

        'verify' => 'Тест моментальних команд',

        'rcon_password' => 'Пароль RCON',
        'rcon_port' => 'Порт RCON',
        'query_port' => 'Вихідний порт запиту',
        'unturned_info' => 'Ви повинні використовувати тип SRCDS RCON в OpenMod. RocketMod RCON не сумісний!',

        'azlink' => [
            'port' => 'AzLink порт',

            'link' => 'Щоб прив\'язати ваш сервер до сайту за допомогою AzLink:',
            'link1' => '<a href="https://azuriom.com/azlink">Завантажте плагін AzLink</a> та встановіть його на сервер.',
            'link2' => 'Перезавантажити сервер.',
            'link3' => 'Виконати цю команду на сервері: ',

            'info' => 'Якщо у вас виникли проблеми з AzLink при використанні Cloudflare або брандмауер, спробуйте повторити дії в <a href="https://azuriom.com/docs/faq" target="_blank" rel="noopener norefferer">FAQ</a>.',
            'command' => 'Ви можете зв\'язати сервер Minecraft з сайтом за допомогою команди: ',
            'port_command' => 'Якщо ви використовуєте інший порт AzLink, ніж стандартний, ви повинні налаштувати його за допомогою команди: ',
            'ping' => 'Увімкнути команди (потрібен відкритий порт на сервері)',
            'ping_info' => 'Коли команди не активні, команди будуть виконуватися з затримкою від 30 секунд до 1 хвилини.',
            'custom_port' => 'Використовувати власний порт AzLink',

            'error' => 'Не вдалося підключитися до серверу. Адреса та/або порт є невірними, або порт закрито.',
            'badresponse' => 'З’єднання з сервером невдале (код :code), токен недійсний або сервер неправильно налаштований. Ви можете повторно виконати команду посилання, щоб виправити це.',
        ],

        'players' => 'Гравців онлайн: :count|Гравців онлайн: :count',
        'offline' => 'Офлайн',

        'connected' => 'З’єднання з сервером успішно виконано!',
        'error' => 'Помилка з’єднання з сервером: :error',

        'type' => [
            'mc-ping' => 'Minecraft Ping',
            'mc-rcon' => 'Minecraft RCON',
            'mc-azlink' => 'AzLink',
            'source-query' => 'Вихідний запит',
            'source-rcon' => 'Source RCON',
            'steam-azlink' => 'AzLink',
            'bedrock-ping' => 'Bedrock Ping',
            'bedrock-rcon' => 'Bedrock RCON',
            'fivem-status' => 'FiveM статус',
            'fivem-rcon' => 'FiveM RCON',
            'rust-rcon' => 'Rust RCON',
            'flyff-server' => 'Сервер Flyff', // TODO make this dynamic
        ],
    ],

    'users' => [
        'title' => 'Користувачі',
        'edit' => 'Редагувати користувача :user',
        'create' => 'Створити користувача',

        'registered' => 'Зареєстровано в',
        'last_login' => 'Останній вхід в',
        'ip' => 'IP-адреса',

        'admin' => 'Адміністратор',
        'banned' => 'Заблокований',
        'deleted' => 'Видалено',

        'ban' => 'Заблокувати',
        'unban' => 'Розблокувати',
        'delete' => 'Видалити',

        'alert-deleted' => 'Користувача видалено, тому його неможливо відредагувати.',
        'alert-banned' => [
            'title' => 'Цей користувач в даний час заблокований:',
            'banned-by' => 'Заблокований адміністратором :author',
            'reason' => 'Причина: :reason',
            'date' => 'Дата: :date',
        ],

        'edit_profile' => 'Редагувати профіль',

        'info' => 'Відомості про користувача',

        'ban-title' => 'Заблокувати :user',
        'ban-description' => 'Ви впевнені, що хочете заблокувати цього користувача?',

        'email' => [
            'verify' => 'Підтвердити електронну адресу',
            'verified' => 'Адресу електронної пошти підтверджено',
            'date' => 'Так, о :date',
            'verify_success' => 'Адресу електронної пошти підтверджено.',
        ],

        '2fa' => [
            'title' => 'Двофакторна автентифікація',
            'secured' => '2FA увімкнено',
            'disable' => 'Вимкнути 2FA',
            'disabled' => 'Двофакторна автентифікація вимкнена.',
        ],

        'password' => [
            'title' => 'Остання зміна пароля',
            'force' => 'Примусова зміна',
            'forced' => 'Необхідно змінити пароль',
        ],

        'status' => [
            'banned' => 'Користувач заблокований.',
            'unbanned' => 'Користувача розблоковано.',
        ],

        'discord' => 'Прив\'язаний обліковий запис Discord',

        'notify' => 'Надіслати сповіщення',
        'notify_info' => 'Надіслати сповіщення цьому користувачу',
        'notify_all' => 'Надіслати сповіщення всім користувачам',
    ],

    'roles' => [
        'title' => 'Ролі',
        'edit' => 'Редагувати роль :role (#:id)',
        'create' => 'Створити роль',

        'info' => '(ID: :id, Сила: :power)',

        'default' => 'За замовчуванням',
        'admin' => 'Адміністратор',
        'admin_info' => 'Учасники групи з правами адміністратора мають всі права доступу.',

        'updated' => 'Роль оновлена.',
        'unauthorized' => 'Ця роль вища за вашу роль.',
        'add_admin' => 'Ви не можете додати права адміністратора для ролі.',
        'remove_admin' => 'Ви не можете видалити права адміністратора вашої ролі.',
        'delete_default' => 'Ця роль не може бути видалена.',
        'delete_own' => 'Ви не можете видалити свою роль.',

        'discord' => [
            'title' => 'Прив\'язати ролі Discord',
            'enable' => 'Увімкнути приєднання ролей Discord',
            'enable_info' => 'Після ввімкнення відредагуйте роль на Discord і додайте вимогу в вкладку <b>Ролі</b>. Користувачі можуть отримати свою роль Discord в меню сервера, в розділі <b>Пов\'язані ролі</b>.',
            'info' => 'Ви повинні створити додаток у <a href="https://discord.com/developers/applications" target="_blank">Панель керування розробників Discord</a> і встановити <b>Linked Role Verification URL</b> на <code>:url</code>',
            'oauth' => 'Потім, у <b>OAuth2</b> та у <b>General</b>, ви повинні додати<code>:url</code> у<b>Redirects</b>.',
            'token_info' => 'Токен бота можна отримати при створенні бота в вашому застосунку, на вкладці <b>Bot</b> ліворуч від панелі розробника Discord.',

            'token' => 'Токен бота Discord',
            'client_id' => 'Ідентифікатор клієнта Discord',
            'client_secret' => 'Discord Client Secret',
        ],
    ],

    'permissions' => [
        'create-comments' => 'Коментувати публікацію',
        'delete-other-comments' => 'Видаляти коментарі інших користувачів',
        'maintenance-access' => 'Доступ до сайту під час тех. обслуговування',
        'admin-access' => 'Доступ до панелі управління',
        'admin-logs' => 'Перегляд та керування логами сайту',
        'admin-images' => 'Перегляд та керування зображеннями',
        'admin-navbar' => 'Перегляд та керування панеллю навігації',
        'admin-pages' => 'Перегляд та керування сторінками',
        'admin-redirects' => 'Перегляд та керування перенаправленнями',
        'admin-posts' => 'Перегляд та керування публікаціями',
        'admin-settings' => 'Перегляд та керування налаштуваннями',
        'admin-users' => 'Перегляд та керування користувачами',
        'admin-themes' => 'Перегляд та керування темами',
        'admin-plugins' => 'Перегляд та керування модулями',
    ],

    'bans' => [
        'title' => 'Бани',

        'by' => 'Заблокував:',
        'reason' => 'Причина',
        'removed' => 'Видалено :date :user',
    ],

    'posts' => [
        'title' => 'Публікації',
        'edit' => 'Редагувати публікацію :post',
        'create' => 'Створити публікацію',

        'published_info' => 'Публікацію не буде видно до цієї дати.',
        'pin' => 'Закріпити цей пост',
        'pinned' => 'Прикріплено',
        'feed' => 'RSS/Atom стрічка записів доступна на сторінці <code>:rs</code> і <code>:atom</code>.',
    ],

    'pages' => [
        'title' => 'Сторінки',
        'edit' => 'Редагувати сторінку #:page',
        'create' => 'Створити сторінку',

        'enable' => 'Активувати сторінку',
        'restrict' => 'Обмеження ролей, які зможуть отримати доступ до цієї сторінки',
    ],

    'redirects' => [
        'title' => 'Перенаправлення',
        'edit' => 'Редагування перенаправлення :redirect',
        'create' => 'Створення редіректу',

        'enable' => 'Увімкнути редірект',
        'source' => 'Джерело',
        'destination' => 'Призначення',
        'code' => 'Код статусу',

        '301' => '301 - Постійне перенаправлення',
        '302' => '302 - Тимчасове перенаправлення',
    ],

    'images' => [
        'title' => 'Зображення',
        'edit' => 'Редагувати зображення :image',
        'create' => 'Завантажити зображення',
        'help' => 'Якщо зображення не завантажено, спробуйте повторити проки в <a href="https://azuriom.com/docs/faq" target="_blank" rel="noopener norefferer">ЧаПи</a>.',
    ],

    'extensions' => [
        'buy' => 'Придбати за :price',
    ],

    'plugins' => [
        'title' => 'Модулі',

        'list' => 'Встановлені модулі',
        'available' => 'Доступні модулі',

        'requirements' => [
            'api' => 'Ця версія модуля не сумісна з Azuriom v:version.',
            'azuriom' => 'Цей плагін не сумісний з вашою версією Azuriom.',
            'game' => 'Даний модуль несумісний з грою :game.',
            'plugin' => 'Модуль ":plugin" відсутній або його версія не сумісна з цим модулем.',
        ],

        'reloaded' => 'Плагіни було перезавантажено.',
        'enabled' => 'Модуль увімкнено.',
        'disabled' => 'Плагін був відключений.',
        'updated' => 'Модуль оновлено.',
        'installed' => 'Модуль інстальовано.',
        'deleted' => 'Модуль видалено.',
        'delete_enabled' => 'Модуль має бути відключений перед тим, як його видалити.',
    ],

    'themes' => [
        'title' => 'Теми оформлення',

        'current' => 'Поточна тема',
        'author' => 'Автор: :author',
        'version' => 'Версія: :version',
        'list' => 'Встановлені теми',
        'available' => 'Доступні теми',
        'no-enabled' => 'У вас не увімкнена жодна з тем.',
        'legacy' => 'Ця версія теми не сумісна з Azuriom v:version.',

        'config' => 'Редагування конфігурації',
        'disable' => 'Вимкнути тему',

        'reloaded' => 'Теми були перезавантажені.',
        'no_config' => 'Ця тема не налаштована.',
        'config_updated' => 'Конфігурація теми була оновлена.',
        'invalid' => 'Ця тема не коректна (назва директорії теми має бути ідентифікатор теми).',
        'updated' => 'Тему оновлено.',
        'installed' => 'Тема була встановлена.',
        'deleted' => 'Тему видалено.',
        'delete_current' => 'Не вдалося видалити поточну тему.',
    ],

    'update' => [
        'title' => 'Оновлення',

        'has_update' => 'Доступне оновлення',
        'no_update' => 'Оновлень немає',
        'check' => 'Перевірка оновлень',

        'update' => 'Доступна нова версія <code>:last-version</code> Azuriom. Поточна версія: <code>:version</code>.',
        'changelog' => 'Список змін доступний <a href=":url" target="_blank" rel="noopener noreferrer">тут</a>.',
        'download' => 'Остання версія Azuriom готова до завантаження.',
        'install' => 'Найновішу версію Azuriom було завантажено та підготовлено до установки.',

        'backup' => 'Перед оновленням Azuriom, створюйте резервну копію вашого сайту!',

        'latest_version' => 'Ви використовуєте останню версію Azuriom: <code>:version</code>.',
        'latest' => 'Ви користуєтеся найновішою версією Azuriom.',

        'downloaded' => 'Остання версія завантажена, ви можете встановити її.',
        'installed' => 'Оновлення було успішно встановлено.',
    ],

    'logs' => [
        'title' => 'Логи',

        'clear' => 'Очистити старі журнали (старше15 днів)',
        'cleared' => 'Старі журнали видалені.',
        'changes' => 'Зміни',
        'old' => 'Старе значення',
        'new' => 'Нове значення',

        'pages' => [
            'created' => 'Створено сторінку #:id',
            'updated' => 'Оновлено сторінку #:id',
            'deleted' => 'Видалена сторінка #:id',
        ],

        'posts' => [
            'created' => 'Створено публікацію #:id',
            'updated' => 'Оновлено публікацію #:id',
            'deleted' => 'Видалено публікацію #:id',
        ],

        'images' => [
            'created' => 'Створено зображення #:id',
            'updated' => 'Оновлено зображення #:id',
            'deleted' => 'Видалено зображення #:id',
        ],

        'redirects' => [
            'created' => 'Створено перенаправлення #:id',
            'updated' => 'Оновлено перенаправлення #:id',
            'deleted' => 'Видалено перенаправлення #:id',
        ],

        'roles' => [
            'created' => 'Створена роль #:id',
            'updated' => 'Оновлено роль #:id',
            'deleted' => 'Видалено роль #:id',
        ],

        'servers' => [
            'created' => 'Створено сервер #:id',
            'updated' => 'Оновлено сервер #:id',
            'deleted' => 'Видалено сервер #:id',
        ],

        'users' => [
            'updated' => 'Оновлено користувача #:id',
            'deleted' => 'Видалено користувача #:id',
            'transfer' => 'Переказати кошти :money користувачу #:id',

            'login' => 'Успішний вхід з :ip (2FA: :2fa)',
            '2fa' => [
                'enabled' => 'Увімкнути двофакторну аутентифікацію',
                'disabled' => 'Вимкнути двофакторну аутентифікацію',
            ],
        ],

        'settings' => [
            'updated' => 'Налаштування оновлені',
        ],

        'updates' => [
            'installed' => 'Оновлення Azuriom встановлене',
        ],

        'plugins' => [
            'enabled' => 'Модуль увімкнено',
            'disabled' => 'Модуль вимкнено',
        ],

        'themes' => [
            'changed' => 'Тема змінена',
            'configured' => 'Оновлено налаштування теми',
        ],
    ],

    'errors' => [
        'back' => 'Повернутися до панелі управління',
        '404' => 'Сторінку не знайдено',
        'info' => 'Схоже, ви знайшли збій у матриці...',
        '2fa' => 'Ви повинні увімкнути двофакторну автентифікацію для доступу до цієї сторінки.',
    ],
];
