<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Mail Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used by the mail library to build
    | the mails layout.
    |
    */

    'hello' => 'Привіт!',
    'whoops' => 'Йой!',

    'regards' => 'З повагою,',

    'link' => "Якщо у вас виникли проблеми з переходом через кнопку \":actionText\", просто скопіюйте та вставте цей URL у новій вкладці: [:displayableActionUrl](:actionURL)",

    'copyright' => '&copy; :year :name. Всі права захищені.',

    'test' => [
        'subject' => 'Тестове повідомлення від :name',
        'content' => 'Якщо ви бачите цей лист, це означає, що відправка листів від :name працює!',
    ],

    'delete' => [
        'subject' => 'Запит на видалення облікового запису',
        'line1' => 'Ви отримали цей лист, тому що ми отримали запит на видалення вашого облікового запису.',
        'action' => 'Видалити мій обліковий запис',
        'line2' => 'Цю дію скасувати не можна. Вона назавжди видалить ваш профіль і всі його дані. Термін цього посилання закінчиться через :count хвилин.',
        'line3' => 'Якщо ви не запитували видалення облікового запису, будь ласка, перевірте свої налаштування безпеки.',
    ],
];
