<?php

return [

    'lang' => 'Українська',

    'date' => [
        'default' => 'j F Y',
        'full' => 'j F, Y \о G:i',
        'compact' => 'd.m.Y \о G:i',
    ],

    'nav' => [
        'toggle' => 'Перемкнути навігацію',
        'profile' => 'Профіль',
        'admin' => 'Панель керування',
    ],

    'actions' => [
        'add' => 'Додати',
        'back' => 'Назад',
        'browse' => 'Обрати',
        'cancel' => 'Скасувати',
        'choose_file' => 'Виберіть файл',
        'close' => 'Закрити',
        'comment' => 'Коментувати',
        'continue' => 'Продовжити',
        'copy' => 'Скопіювати',
        'create' => 'Створити',
        'delete' => 'Видалити',
        'disable' => 'Вимкнути',
        'download' => 'Завантажити',
        'duplicate' => 'Дублювати',
        'edit' => 'Редагувати',
        'enable' => 'Увімкнути',
        'generate' => 'Основне',
        'install' => 'Інсталювати',
        'refresh' => 'Оновити',
        'reload' => 'Перезавантажити',
        'remove' => 'Вилучити',
        'save' => 'Зберегти',
        'search' => 'Пошук',
        'send' => 'Надіслати',
        'show' => 'Показати',
        'update' => 'Оновити',
        'upload' => 'Вивантажити',
    ],

    'fields' => [
        'action' => 'Дії',
        'address' => 'Адреса',
        'author' => 'Автор',
        'category' => 'Категорія',
        'color' => 'Колір',
        'content' => 'Вміст',
        'date' => 'Дата',
        'description' => 'Опис',
        'enabled' => 'Активовано',
        'file' => 'Файл',
        'game' => 'Гра',
        'icon' => 'Іконка',
        'image' => 'Зображення',
        'link' => 'Посилання',
        'money' => 'Гроші',
        'name' => 'Назва',
        'permissions' => 'Права доступу',
        'port' => 'Порт',
        'price' => 'Вартість',
        'published_at' => 'Опубліковано в',
        'quantity' => 'Кількість',
        'role' => 'Ролі',
        'server' => 'Сервер',
        'short_description' => 'Короткий опис',
        'slug' => 'Slug',
        'status' => 'Статус',
        'title' => 'Заголовок',
        'type' => 'Тип',
        'url' => 'Посилання',
        'user' => 'Користувач',
        'value' => 'Значення',
        'version' => 'Версія',
    ],

    'status' => [
        'success' => 'Дія успішно завершена!',
        'error' => 'Сталася помилка: :error',
    ],

    'range' => [
        'days' => 'По дням',
        'months' => 'По місяцям',
    ],

    'loading' => 'Завантаження...',

    'yes' => 'Так',
    'no' => 'Ні',
    'unknown' => 'Невідомо',
    'other' => 'Інше',
    'none' => 'Не задано',
    'copied' => 'Скопійовано',
    'icons' => 'Список доступних значків на <a href="https://icons.getbootstrap.com/" target="_blank" rel="noopener noreferrer">Bootstrap</a>.',

    'home' => 'Головна',
    'servers' => 'Сервери',
    'news' => 'Новини',
    'welcome' => 'Ласкаво просимо, :name',
    'copyright' => 'Запущено на <a href="https://azuriom.com" target="_blank" rel="noopener noreferrer">Azuriom</a>.',

    'maintenance' => [
        'title' => 'Технічне обслуговування',
        'message' => 'На даний момент вебсайт знаходиться на тех. обслуговуванні.',
    ],

    'theme' => [
        'light' => 'Світла тема',
        'dark' => 'Темна тема',
    ],

    'captcha' => 'Не вдалося пройти перевірку капчі, будь ласка, повторіть спробу.',

    'notifications' => [
        'notifications' => 'Сповіщення',
        'read' => 'Відмітити як прочитане',
        'empty' => 'У вас немає непрочитаних сповіщень.',
        'level' => 'Рівень',
        'info' => 'Інформація',
        'warning' => 'Попередження',
        'danger' => 'Небезпека',
        'success' => 'Успішно',
    ],

    'clipboard' => [
        'copied' => 'Скопійовано!',
        'error' => 'CTRL + C для копіювання',
    ],

    'server' => [
        'join' => 'Приєднатися',
        'total' => ':count/:максимально гравців|:count/:максимально гравців онлайн',
        'online' => 'Гравців онлайн: :count|Гравців онлайн: :count',
        'offline' => 'Сервер вимкнений.',
    ],

    'profile' => [
        'title' => 'Мій профіль',
        'change_email' => 'Змінити електрону адресу',
        'change_password' => 'Змінити пароль',
        'change_name' => 'Змінити Ім\'я користувача',

        'delete' => [
            'btn' => 'Видалити мій обліковий запис',
            'title' => 'Обліковий запис видалено',
            'info' => 'Ця дія остаточно видалить обліковий запис і пов\'язані дані. Цю дію не можна скасувати.',
            'email' => 'Ми надішлемо підтвердження на електрону адресу, щоб підтвердити цю дію.',
            'sent' => 'Лист для підтвердження надіслано на вашу електронну адресу.',
            'success' => 'Ваш обліковий запис було успішно видалено!',
        ],

        'email_verification' => 'Вашу ел. адресу не підтверджено. Будь ласка, перейдіть за посиланням в листі для підтвердження.',
        'updated' => 'Ваш профіль оновлено.',

        'info' => [
            'role' => 'Роль: :role',
            'register' => 'Зареєстровано: :date',
            'money' => 'Рахунок: :money',
            '2fa' => 'Двофакторна автентифікація (2FA): :2fa',
            'discord' => 'Прив\'язаний обліковий запис Discord: :user',
        ],

        '2fa' => [
            'enable' => 'Увімкнути 2FA',
            'disable' => 'Вимкнути 2FA',
            'manage' => 'Управління 2FA',
            'info' => 'Проскануйте QR-код вище за допомогою додатку двофакторної аутентифікації на вашому телефоні, наприклад, <a href="https://authy.com/" target="_blank" rel="noopener norefferer">Authy</a>, <a href="https://outercorner.com/secrets-ios/" target="_blank" rel="noopener norefferer">Secrets</a> або Google Authenticator.',
            'secret' => 'Секретний ключ: :secret',
            'title' => 'Двофакторна автентифікація',
            'codes' => 'Показати коди відновлення',
            'code' => 'Код',
            'enabled' => 'В даний час увімкнено двофакторну аутентифікацію. Не забудьте зберегти свої коди відновлення!',
            'disabled' => 'Двофакторна аутентифікація вимкнена.',
        ],

        'discord' => [
            'link' => 'Прив\'язати Discord',
            'unlink' => 'Відв\'язати Discord',
            'linked' => 'Ваш профіль Discord успішно прив\'язано.',
        ],

        'money_transfer' => [
            'title' => 'Грошовий переказ',
            'user' => 'Користувача не знайдено.',
            'balance' => 'У Вас недостатньо коштів, для завершення даної транзакції.',
            'success' => 'Кошти було успішно перераховано.',
            'notification' => ':user перевів на ваш рахунок :money.',
        ],
    ],

    'posts' => [
        'posts' => 'Публікації',
        'posted' => 'Опубліковано :date, автор :user',
        'unpublished' => 'Цей допис ще не опубліковано.',
        'read' => 'Детальніше',
    ],

    'comments' => [
        'create' => 'Залишити коментар',
        'guest' => 'Вам потрібно увійти в систему, щоб залишити коментар.',
        'author' => '<strong>:user</strong> прокоментував :date',
        'content' => 'Ваш коментар',
        'delete' => 'Вилучити?',
        'delete_confirm' => 'Ви впевнені, що хочете видалити цей коментар?',
    ],

    'likes' => 'Вподобання: :count',

    'markdown' => [
        'init' => 'Додати файли, перетягнувши або вставляючи їх з буфера обміну.',
        'drag' => 'Перетягніть зображення для завантаження.',
        'drop' => 'Завантаження зображення #images_names#...',
        'progress' => 'Завантаження #file_name#: #progress#%',
        'uploaded' => 'Завантажено #image_name#',

        'size' => 'Зображення #image_name# завелике (#image_size#).\nМаксимальний розмір файлу #image_max_size#.',
        'error' => 'Щось пішло не так при завантаженні зображення #image_name#.',
    ],

    'discord_roles' => [
        'id' => [
            'name' => 'ID ролі',
            'description' => 'ID ролі на веб-сайті.',
        ],

        'power' => [
            'name' => 'Сила ролі',
            'description' => 'Сила ролі на сайті рівна або більше ніж',
        ],
    ],
];
